In [1]:
import pandas as pd

In [2]:
df =  pd.read_csv('slagelse_data.csv')

In [3]:
df.head()

   CVR Nummer                                               Navn Kommune Navn
0    15754176            Slagelse Erhvervsforening Team Slagelse     SLAGELSE
1    34232261                 Gravstenen.dk v/Thomas Worm Hansen     SLAGELSE
2    41447281                    Grundejerforeningen Hyllerupvej     SLAGELSE
3    32331203                                      NETTOTELT ApS     SLAGELSE
4    26476208  Handelsby.dk                      v/Brian M. L...     SLAGELSE

In [6]:
df[df.duplicated()]

      CVR Nummer                              Navn Kommune Navn
1006    32857191  Addina v/Michal Pentti Lorentsen     SLAGELSE
1007    34076316                          JOSK ApS     SLAGELSE
1008    37280283   Nifingers Gospel Magic & Events     SLAGELSE
1009    34744483                    Ars Nova-koret     SLAGELSE
1010    37511994            Korsør Nor Inner Wheel     SLAGELSE